УНФ_ТЕСТ/src/Catalogs/БланкиДоговоров/БланкиДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиДоговоров</name>
  <predefined>
    <items>
      <name>ДоговорАренды</name>
      <description>Договор аренды</description>
    </items>
    <items>
      <name>ДоговорКуплиПродажи</name>
      <description>Договор купли-продажи</description>
    </items>
    <items>
      <name>ДоговорОказанияУслуг</name>
      <description>Договор оказания услуг</description>
    </items>
    <items>
      <name>ДоговорПоставки</name>
      <description>Договор поставки</description>
    </items>
  </predefined>
  <attributes>
    <name>Бланк</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>МакетПредопределенногоБланка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРедактируемыхПараметров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РедактируемыеПараметры</name>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыИнфобазы</name>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>EnumRef.ПараметрыБланковДоговоровСКонтрагентами</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/БланкиДоговоров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТекстПоставляемогоБланка(ИмяМакета) Экспорт
	
	МакетДоговора = Справочники.БланкиДоговоров.ПолучитьМакет(ИмяМакета);
	
	ТекстХТМЛ = МакетДоговора.ПолучитьТекст();
	
	Падежи = Новый Массив;
	Падежи.Добавить(Неопределено);
	Падежи.Добавить("именительный");
	Падежи.Добавить("родительный");
	Падежи.Добавить("дательный");
	Падежи.Добавить("винительный");
	Падежи.Добавить("творительный");
	Падежи.Добавить("предложный");
	
	Для каждого ПараметрПеречисление Из Перечисления.ПараметрыБланковДоговоровСКонтрагентами Цикл
		
		Для каждого Падеж Из Падежи Цикл
			Если Падеж = Неопределено Тогда
				ПредставлениеПадежа = "";
			Иначе
				ПредставлениеПадежа = " (" + Падеж + ")";
			КонецЕсли;
			
			Параметр = "{" + Строка(ПараметрПеречисление) + ПредставлениеПадежа + "}";
			ЧислоВхождений = СтрЧислоВхождений(ТекстХТМЛ, Параметр);
			Для НомерПараметра = 1 По ЧислоВхождений Цикл
				Если НомерПараметра = 1 Тогда
					Представление = "{" + Строка(ПараметрПеречисление) + ПредставлениеПадежа + "%deleteSymbols%" + "}";
					Идентификатор = "infoParameter" + Строка(ПараметрПеречисление) + НомерПараметра;
				Иначе
					Представление = "{" + Строка(ПараметрПеречисление) + НомерПараметра + ПредставлениеПадежа + "}";
					Идентификатор = "infoParameter" + Строка(ПараметрПеречисление) + НомерПараметра;
				КонецЕсли;
				
				ПервоеВхождение = Найти(ТекстХТМЛ, Параметр);
				
				ТекстХТМЛ = Лев(ТекстХТМЛ, ПервоеВхождение - 1) + Представление + Сред(ТекстХТМЛ, ПервоеВхождение + СтрДлина(Параметр));
				
			КонецЦикла;
			
			ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%deleteSymbols%", "");
			
		КонецЦикла;
	КонецЦикла;
	
	ВложенияФД = Новый Структура;
	ФД = Новый ФорматированныйДокумент;
	ФД.УстановитьHTML(ТекстХТМЛ, ВложенияФД);
	ФД.ПолучитьHTML(ТекстХТМЛ, ВложенияФД);
	
	Возврат ТекстХТМЛ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
